# Core
brew "git"
brew "gh"
brew "zsh"
brew "tmux"
brew "neovim"
brew "node"
brew "wget"
brew "jq"

# Languages & runtimes
brew "python@3.12"

# Modern CLI tools
brew "fzf"
brew "lazygit"
brew "zoxide"
brew "mprocs"
brew "yazi"

# Cloud & infra
brew "awscli"
brew "docker-compose"

# Casks — Apps
cask "cursor"
cask "dbeaver-community"
cask "iterm2"
cask "claude"
cask "logi-options+"
cask "1password"
cask "1password-cli"

